
/*---------------------------------------------------------------------*
 *                                                                     *
 *                          GBC APU                                    *
 *                                                                     *
 *                                                                     *
 *       project: Gameboy Color Emulator                               *
 *   module name: apu.c                                                *
 *        author: tstr92                                               *
 *          date: 2025-04-27                                           *
 *                                                                     *
 *---------------------------------------------------------------------*/


/*---------------------------------------------------------------------*
 *  include files                                                      *
 *---------------------------------------------------------------------*/
#include <stdbool.h>

#include "apu.h"
#include "bus.h"
#include "timer.h"
#include "debug.h"

/*---------------------------------------------------------------------*
 *  local definitions                                                  *
 *---------------------------------------------------------------------*/
#define APU_ADDR_CH1_SWEEP            0xFF10
#define APU_ADDR_CH1_LENGTH_TIM_DC    0xFF11
#define APU_ADDR_CH1_VOL_ENVELOPE     0xFF12

#define APU_ADDR_CH2_PERIOD_LOW       0xFF18
#define APU_ADDR_CH2_PERIOD_HIGH_CTRL 0xFF19
#define APU_ADDR_CH3_DAC_EN           0xFF1A
#define APU_ADDR_CH3_LENGTH_TIM       0xFF1B
#define APU_ADDR_CH3_OUT_LVL          0xFF1C
#define APU_ADDR_CH3_PERIOD_LOW       0xFF1D
#define APU_ADDR_CH3_PERIOD_HIGH_CTRL 0xFF1E
#define APU_ADDR_CH4_LENGTH_TIM       0xFF20
#define APU_ADDR_CH4_VOL_ENVELOPE     0xFF21
#define APU_ADDR_CH4_FREQ_RAND        0xFF22
#define APU_ADDR_CH4_CTRL             0xFF23
#define APU_ADDR_MASTER_VOL_VIN_PAN   0xFF24
#define APU_ADDR_SOUND_PANNING        0xFF25
#define APU_ADDR_AUDIO_MASTER_CONTROL 0xFF26

#define AUDIO_MASTER_CONTROL_AUDIO_ON (1<<7)
#define AUDIO_MASTER_CONTROL_CH1_ON   (1<<0)
#define AUDIO_MASTER_CONTROL_CH2_ON   (1<<0)
#define AUDIO_MASTER_CONTROL_CH3_ON   (1<<0)
#define AUDIO_MASTER_CONTROL_CH4_ON   (1<<0)

#define PANNING_CH1_RIGHT             (1<<0)
#define PANNING_CH2_RIGHT             (1<<1)
#define PANNING_CH3_RIGHT             (1<<2)
#define PANNING_CH4_RIGHT             (1<<3)
#define PANNING_CH1_LEFT              (1<<4)
#define PANNING_CH2_LEFT              (1<<5)
#define PANNING_CH3_LEFT              (1<<6)
#define PANNING_CH4_LEFT              (1<<7)

#define CH12_DC_MSK                    0xC0
#define CH12_DC_POS                    6
#define CH_LENGTH_TIMER_MSK            0x3F
#define CH12_DC_12_5_PERCENT           0x0
#define CH12_DC_25_PERCENT             0x1
#define CH12_DC_50_PERCENT             0x2
#define CH12_DC_75_PERCENT             0x3
#define CH_LENGTH_EN                   0x40
#define CH_TRIGGER                     0x80
#define CH123_PERIOD_HIGH_MSK          0x07
#define CH12_SWEEP_PACE_MSK            0x70
#define CH12_SWEEP_PACE_POS            4
#define CH12_SWEEP_DIR_SUBTRACT_MSK    0x08
#define CH12_SWEEP_STEP_MSK            0x07
#define CH124_INITIAL_VOLUME_MSK       0xF0
#define CH124_INITIAL_VOLUME_POS       4
#define CH124_ENV_DIR_INC_MSK          0x08
#define CH124_ENV_SWEEP_PACE_MSK       0x07
#define CH3_DAC_EN_MSK                 0x80
#define CH3_OUTPUT_LEVEL_MSK           0x60
#define CH3_OUTPUT_LEVEL_POS           5
#define CH3_OUTPUT_LEVEL_SHIFT_MSK     0x03
#define CH4_LFSR_CLOCK_SHIFT_MSK       0xF0
#define CH4_LFSR_CLOCK_SHIFT_POS       4
#define CH4_LFSR_WIDTH_7               0x08
#define CH4_LFSR_CLK_DIV_MSK           0x07


#define TIMER_ADDR_DIV   0xFF04
#define TIMER_GET_DIV() gbc_timer_get_memory(TIMER_ADDR_DIV);

#define DIV_APU_BIT (1<<5)

#define CH12_PERIOD_PRESCALER          4  /*  4 MHz /  4 =   1.000 MHz */
#define CH3_PERIOD_PRESCALER           2  /*  4 MHz /  2 =   2.000 MHz */
#define CH4_LFSR_PRESCALER             16 /*  4 MHz / 16 = 262.144 kHz */
#define CH12_PERIOD_SWEEP_PRESCALER    4  /* 512 Hz /  4 = 128.000  Hz */
#define CH_LENGTH_TIMER_PRESCALER      2  /* 512 Hz /  2 = 256.000  Hz */
#define CH124_ENVELOPE_SWEEP_PRESCALER 8  /* 512 Hz /  8 =  64.000  Hz */
#define CH123_PERIOD_OVERFLOW          0x800
#define CH12_LENGTH_TIMER_OVERFLOW     64

typedef struct
{
    uint8_t ch1_sweep;              // 0xFF10
    uint8_t ch1_length_tim_dc;      // 0xFF11
    uint8_t ch1_vol_envelope;       // 0xFF12
    uint8_t ch1_period_low;         // 0xFF13
    uint8_t ch1_period_high_ctrl;   // 0xFF14
    uint8_t ch2_length_tim_dc;      // 0xFF15
    uint8_t ch2_vol_envelope;       // 0xFF17
    uint8_t ch2_period_low;         // 0xFF18
    uint8_t ch2_period_high_ctrl;   // 0xFF19
    uint8_t ch3_dac_en;             // 0xFF1A
    uint8_t ch3_length_tim;         // 0xFF1B
    uint8_t ch3_out_lvl;            // 0xFF1C
    uint8_t ch3_period_low;         // 0xFF1D
    uint8_t ch3_period_high_ctrl;   // 0xFF1E
    uint8_t ch4_length_tim;         // 0xFF20
    uint8_t ch4_vol_envelope;       // 0xFF21
    uint8_t ch4_freq_rand;          // 0xFF22
    uint8_t ch4_ctrl;               // 0xFF23
    uint8_t master_vol_vin_pan;     // 0xFF24
    uint8_t sound_panning;          // 0xFF25
    uint8_t audio_master_control;   // 0xFF26
    uint8_t wave_ram[0x10];         // 0xFF30 - 0xFF3F

    bool wave_ram_busy;
    uint8_t wave_ram_current_byte;
} apu_t;

typedef struct
{
    bool running;
    uint8_t id;
    bool wave_level_high;
    
    /* period, DC*/
    uint16_t duty_cycle;         // in 0.1%
    uint16_t period;             // period from registers
    uint16_t period_counter;     // period-clock: 1MHz
    uint8_t  period_prescaler;   // @CPU-CLK: prescaler to generate period-clock

    /* period sweep */
    uint8_t period_sweep_step;             // sets size of sweep step
    bool    period_sweep_dir_subtract;     // decrease period on sweep?
    uint8_t period_sweep_pace;             // sweep frequency (in 128Hz steps)
    uint8_t period_sweep_pace_counter;     // counts up to pace at 128Hz
    uint8_t period_sweep_pace_prescaler;   // divides div_apu(512Hz) down to 128Hz

    /* length timer */
    uint8_t  length_timer;             // counts up to 64 and turns off ch1/ch2
